<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a61403e1fb1c519b7062883cbb636d003b2529b4d5844caabf08d20dd8268dd9","plan_job_ref":"Job Plan Airflow DAGs #457 at https://github.com/cal-itp/data-infra/actions/runs/16890637512","plan_out_hash":"6f841794203a7fef518ce62b4354f4498def13127ed4453eaad68fa3ef12577e","plan_hash":"24ceedfaad194ef61b65b0d0cf0b39d17839bd6907b0ebdb37c9831dbcf482c9","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_daily_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_daily_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_daily_dag.py"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #457](https://github.com/cal-itp/data-infra/actions/runs/16890637512)